In [1]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [13]:
def serverconnection(host_name,user_name,password):
    connection=None
    try:
        connection= mysql.connector.connect(
        host=host_name,
        user=user_name,
        passwd=password)
        print("My Sql Database Connection Successfull")
    except Error as err:
        print(F"Error:'{err}'")
    return connection
pw="admin123"
db="My_sql_"
connection=serverconnection("localhost","root",pw)

My Sql Database Connection Successfull

In [8]:
def createdatabase(connection,query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("database create successfully")
    except Error as err:
        print(F"Error:'{err}'")
create_query="Create database My_sql_"
createdatabase(connection,create_query)

database create successfully

In [9]:
def dbconnection(host_name,user_name,password,db_name):
    connection=None
    try:
        connection= mysql.connector.connect(
        host=host_name,
        user=user_name,
        passwd=password,
        database=db_name)
        print("My Sql Database Connection Successfull")
    except Error as err:
        print(F"Error:'{err}'")
    return connection

In [10]:
def execute_query(connection,query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was  successfully")
    except Error as err:
        print(F"Error:'{err}'")

In [14]:
create_order_table="""
create table orders(
order_id int primary key,
customer_name varchar(20) not null,
product_name varchar(20) not null,
date_ordered date,
quantity int,
unit_price float,
phonme_num varchar(20));
"""

connection=dbconnection("localhost","root",pw,db)
execute_query(connection,create_order_table)

My Sql Database Connection Successfull
Query was  successfully

In [15]:
data_order="""
insert into orders values(101,'Steve','laptop','2018-06-12',2,800,'6293730802'),
(102,'olive','books','2019-07-14',10,12,'8367489124'),
(103,'Alan','Trouser','2017-06-11',12,452,'986591056'),
(104,'karthik','books','2020-05-11',8,120,'8958557608')
"""
connection=dbconnection("localhost","root",pw,db)
execute_query(connection,data_order)

My Sql Database Connection Successfull
Query was  successfully

In [21]:
def read_query(connection,query):
    cursor=connection.cursor()
    result=None
    try:
        cursor.execute(query)
        result=cursor.fetchall()
        return result
    except Error as err:
        print(F"Error:'{err}'")

In [22]:
q1="""
select * from orders;
"""
connection=dbconnection("localhost","root",pw,db)
results=read_query(connection,q1)
for result in results:
    print(result)

My Sql Database Connection Successfull
(101, 'Steve', 'laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(102, 'olive', 'books', datetime.date(2019, 7, 14), 10, 12.0, '8367489124')
(103, 'Alan', 'Trouser', datetime.date(2017, 6, 11), 12, 452.0, '986591056')
(104, 'karthik', 'books', datetime.date(2020, 5, 11), 8, 120.0, '8958557608')

In [24]:
data=[]
for result in results:
    result= list(result)
    data.append(result)
columns=["order_id","customer_name","product_name","date_ordered","quantity","unit_price","phonme_num"]
df=pd.DataFrame(data,columns=columns)
display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phonme_num
0,101,Steve,laptop,2018-06-12,2,800.0,6293730802
1,102,olive,books,2019-07-14,10,12.0,8367489124
2,103,Alan,Trouser,2017-06-11,12,452.0,986591056
3,104,karthik,books,2020-05-11,8,120.0,8958557608